[
    {
        "hero_name": "npc_dota_hero_antimage",
        "hero_id": 1,
        "has_scepter": true,
        "scepter_desc": "After casting Blink, your next Mana Break within 5s burns an additional 20% max mana and prevents the target from regenerating or gaining mana for a short duration. This debuff is undispellable. Blink Cooldown reduced by 1s.",
        "scepter_skill_name": "Blink",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Counterspell Ally may be activated to create an anti-magic shell around an allied hero that blocks and reflects any targeted spells. Any time a spell is blocked by Counterspell or Counterspell Ally, an illusion of Anti-Mage will be created next to the enemy.",
        "shard_skill_name": "Counterspell Ally",
        "shard_new_skill": true
    },
    {
        "hero_name": "npc_dota_hero_axe",
        "hero_id": 2,
        "has_scepter": true,
        "scepter_desc": "Counter Helix now applies a stacking debuff to enemies hit by it that causes them to deal less total attack damage to Axe. Counter Helix no longer has a cooldown and its counter advances when Axe attacks.",
        "scepter_skill_name": "Counter Helix",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Multiple instances of Battle Hunger can stack on a single target.",
        "shard_skill_name": "Battle Hunger",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_bane",
        "hero_id": 3,
        "has_scepter": true,
        "scepter_desc": "Reduces Fiend's Grip cooldown by 45. Fiend's Grip now creates two uncontrollable illusions that are also channeling Fiend's Grip on the target. Illusions take 200% incoming damage and immediately die if they are interrupted. Damage does not stack.",
        "scepter_skill_name": "Fiend's Grip",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Reduces cooldown by 3. Causes Brain Sap to become a 550 AoE spell. Secondary targets only heal for 30%.",
        "shard_skill_name": "Brain Sap",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_bloodseeker",
        "hero_id": 4,
        "has_scepter": true,
        "scepter_desc": "Bloodseeker heals for =30% of the <font color=\"#d8ae53\">Pure</font> damage he deals.",
        "scepter_skill_name": "Sanguivore",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Passively turns all Bloodseeker's overheal from his own abilities into an all damage barrier up to 50% of Bloodseeker's Max Health. Barrier amount decays by 1.5% per second",
        "shard_skill_name": "Sanguivore",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_crystal_maiden",
        "hero_id": 5,
        "has_scepter": true,
        "scepter_desc": "Allows you to move, cast and attack during Freezing Field. Can still be interrupted by enemies. You move 75% slower during this. Increases total number of explosions by 20%. Applies Frostbite to any unit that has been standing in the Freezing Field for over 2.5s.",
        "scepter_skill_name": "Freezing Field",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Slides in a direction, creating a crystal clone of herself in her place and disjointing incoming projectiles. If the clone takes enough damage or times out, it shatters, Frostbiting enemies in a 450 AoE around its place. The Clone can also be destroyed by Crystal Maiden's own spells.",
        "shard_skill_name": "Crystal Clone",
        "shard_new_skill": true
    },
    {
        "hero_name": "npc_dota_hero_drow_ranger",
        "hero_id": 6,
        "has_scepter": true,
        "scepter_desc": "Frost Arrows now apply a Hypothermia stack to enemies, increasing damage from Frost Arrows and reducing their regeneration per stack. If an enemy dies with Hypothermia stacks, they burst and deal damage per stack and slow in an area around it.",
        "scepter_skill_name": "Frost Arrows",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Drow creates a hill of ice beneath her. While standing on the hill, attackers gain bonus attack range and high ground advantage - they cannot miss and gain flying vision. Drow additionally gets bonus Multishot arrows per wave while on the hill. The front of the hill obscures vision and cannot be moved through except by Drow. Does not interrupt Multishot when cast.",
        "shard_skill_name": "Glacier",
        "shard_new_skill": true
    },
    {
        "hero_name": "npc_dota_hero_earthshaker",
        "hero_id": 7,
        "has_scepter": true,
        "scepter_desc": "Enchant Totem becomes a ground target ability, causing Earthshaker to jump in the air and land at the target spot, casting Enchant Totem there.  Self-casting the ability will behave in the original form, without jumping. Grants Enchant Totem a cleaving attack.",
        "scepter_skill_name": "Enchant Totem",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Reduces Fissure cooldown and allows Earthshaker to walk on it. When he casts any ability, an Aftershock is released along its path that stuns for a shortened duration.",
        "shard_skill_name": "Fissure",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_juggernaut",
        "hero_id": 8,
        "has_scepter": true,
        "scepter_desc": "Performs a short Omnislash for 1 seconds.",
        "scepter_skill_name": "Swiftslash",
        "scepter_new_skill": true,
        "has_shard": true,
        "shard_desc": "Increases Blade Fury radius, and slows enemies by 35%.",
        "shard_skill_name": "Blade Fury",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_mirana",
        "hero_id": 9,
        "has_scepter": true,
        "scepter_desc": "Causes Sacred Arrow to release a Starstorm on enemies along the travel path of the primary arrow, releasing a second Starstorm that deals less damage to the impacted unit.",
        "scepter_skill_name": "Sacred Arrow",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Grants +1 Leap charge. Attacks during the Leap buff critically strike for 150% damage.",
        "shard_skill_name": "Leap",
        "shard_new_skill": false
    },
    {
        "hero_name": "npc_dota_hero_morphling",
        "hero_id": 10,
        "has_scepter": true,
        "scepter_desc": "Adds an alt-cast to Morph. When enabled, a strong illusion is created of the target hero that can cast all of the hero's basic abilities. If the illusion is alive when Morphling toggles the ability, he will take the place of the illusion, destroying it.",
        "scepter_skill_name": "Morph",
        "scepter_new_skill": false,
        "has_shard": true,
        "shard_desc": "Morphling can shift attributes while stunned. Reduces mana cost.",
        "shard_skill_name": "Attribute Shift (Strength Gain)",
        "shard_new_skill": false
    }
]
